Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z16xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    /*******************************************************************************
     *
     *  pwm init
     *
     *  *******************************************************************************/
    // tpm config init
    tpm_config_t tpmInfo;
    tpm_chnl_pwm_signal_param_t tpmParam;

#ifndef TPM_LED_ON_LEVEL
  #define TPM_LED_ON_LEVEL kTPM_LowTrue
#endif

    /* Configure tpm params with frequency 24kHZ */
    tpmParam.chnlNumber = (tpm_chnl_t)BOARD_TPM_CHANNEL;
    tpmParam.level = TPM_LED_ON_LEVEL;
    tpmParam.dutyCyclePercent = updatedDutycycle;

/******************************************************************************/

    /* Define the init structure for the output ENABLE pin*/
    gpio_pin_config_t enable_config = {
        kGPIO_DigitalOutput, 0,
    };
    BOARD_InitPins();
    /* Init output ENABLE GPIO. */
    GPIO_PinInit(GPIOA, 7U, &enable_config);
//    GPIO_PinInit(GPIOB, 3U, &enable_config);

    // api to write gpio value
//    GPIO_WritePinOutput(GPIOA, 7U, 1);


    BOARD_BootClockRUN();
    APP_InitDefaultDebugConsole();

    /* Setup LPTMR. */
//    LPTMR_GetDefaultConfig(&lptmrConfig);
//    lptmrConfig.prescalerClockSource = kLPTMR_PrescalerClock_1; /* Use LPO as clock source. */
//    lptmrConfig.bypassPrescaler = true;
//
//    LPTMR_Init(LPTMR0, &lptmrConfig);

    NVIC_EnableIRQ(LLWU_IRQn);
//    NVIC_EnableIRQ(LPTMR0_IRQn);

    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);

    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PRINTF("\r\nMCU wakeup from VLLS modes...\r\n");
    }


//    user_showFreqList();

    // mode now is run 48 MHz


    // update duty
//    updatedDutycycle = 5 * 10U;
//
//    /* Disable channel output before updating the dutycycle */
//    TPM_UpdateChnlEdgeLevelSelect(BOARD_TPM_BASEADDR, (tpm_chnl_t)BOARD_TPM_CHANNEL, 0U);
//
//    /* Update PWM duty cycle */
//    TPM_UpdatePwmDutycycle(BOARD_TPM_BASEADDR, (tpm_chnl_t)BOARD_TPM_CHANNEL, kTPM_CenterAlignedPwm,
//                           updatedDutycycle);
//
//    /* Start channel output with updated dutycycle */
//    TPM_UpdateChnlEdgeLevelSelect(BOARD_TPM_BASEADDR, (tpm_chnl_t)BOARD_TPM_CHANNEL, TPM_LED_ON_LEVEL);


//    while (0)
    {
        curPowerState = SMC_GetPowerModeState(SMC);

        freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);

        PRINTF("\r\n####################  Power Mode Switch Demo ####################\n\r\n");
        PRINTF("    Core Clock = %dHz \r\n", freq);

        APP_ShowPowerMode(curPowerState);

//        PRINTF("\r\nSelect the desired operation \n\r\n");
//        PRINTF("Press  %c for enter: RUN      - Normal RUN mode\r\n", kAPP_PowerModeRun);
//        PRINTF("Press  %c for enter: WAIT     - Wait mode\r\n", kAPP_PowerModeWait);
//        PRINTF("Press  %c for enter: STOP     - Stop mode\r\n", kAPP_PowerModeStop);
//        PRINTF("Press  %c for enter: VLPR     - Very Low Power Run mode\r\n", kAPP_PowerModeVlpr);
//        PRINTF("Press  %c for enter: VLPW     - Very Low Power Wait mode\r\n", kAPP_PowerModeVlpw);
//        PRINTF("Press  %c for enter: VLPS     - Very Low Power Stop mode\r\n", kAPP_PowerModeVlps);
//        PRINTF("Press  %c for enter: VLLS0    - Very Low Leakage Stop 0 mode\r\n", kAPP_PowerModeVlls0);
//        PRINTF("Press  %c for enter: VLLS1    - Very Low Leakage Stop 1 mode\r\n", kAPP_PowerModeVlls1);
//        PRINTF("Press  %c for enter: VLLS3    - Very Low Leakage Stop 3 mode\r\n", kAPP_PowerModeVlls3);
//
//        PRINTF("1\r\n");
//        PRINTF("\r\nWaiting for power mode select..\r\n\r\n");

        /* Wait for user response */

//        ch = GETCHAR();
//
//        if ((ch >= 'a') && (ch <= 'z'))
//        {
//            ch -= 'a' - 'A';
//        }

//        targetPowerMode = (app_power_mode_t)ch;

        // set default powermode as vlpr

        if(curPowerState != kSMC_PowerStateVlpr)
        {
			targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        }
        else
        {
        	ch = GETCHAR();
        	if(ch == '3')
        	{
        		targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlls3;
        	}
        	else
        	{
        		targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        	}
        }
        // A:run, D:vlpr, I:vlls3
        PRINTF("\r\nTarget %c \r\n", targetPowerMode);

		if ((targetPowerMode > kAPP_PowerModeMin) && (targetPowerMode < kAPP_PowerModeMax))
		{
			/* If could not set the target power mode, loop continue. */
			if (!APP_CheckPowerMode(curPowerState, targetPowerMode))
			{
//				continue;
//				break;
			}

			/* If target mode is RUN/VLPR/HSRUN, don't need to set wakeup source. */
			if ((kAPP_PowerModeRun == targetPowerMode) || (kAPP_PowerModeVlpr == targetPowerMode))
			{
				needSetWakeup = false;
			}

			else
			{
				needSetWakeup = true;
			}

			if (needSetWakeup)
			{
				APP_GetWakeupConfig(targetPowerMode);
			}

			APP_PowerPreSwitchHook(curPowerState, targetPowerMode);

			if (needSetWakeup)
			{
				APP_SetWakeupConfig(targetPowerMode);
			}

			APP_PowerModeSwitch(curPowerState, targetPowerMode);
			APP_PowerPostSwitchHook(curPowerState, targetPowerMode);

			PRINTF("\r\nNext loop\r\n");
		}

    };

    // show state
    {
        curPowerState = SMC_GetPowerModeState(SMC);

        freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);

        PRINTF("\r\n####################  Power Mode Switch Demo ####################\n\r\n");
        PRINTF("    Core Clock = %dHz \r\n", freq);

        APP_ShowPowerMode(curPowerState);

    }

//    user_showFreqList();

    // init and run pwm here
    /* Select the clock source for the TPM counter as kCLOCK_McgInternalRefClk */
//    CLOCK_SetTpmClock(1U);
    CLOCK_SetTpmClock(3U);

    TPM_GetDefaultConfig(&tpmInfo);
    /* Initialize TPM module */
    TPM_Init(BOARD_TPM_BASEADDR, &tpmInfo);

//    TPM_SetupPwm(BOARD_TPM_BASEADDR, &tpmParam, 1U, kTPM_CenterAlignedPwm, 1000000U, TPM_SOURCE_CLOCK);
    TPM_SetupPwm(BOARD_TPM_BASEADDR, &tpmParam, 1U, kTPM_CenterAlignedPwm, 1000000U, 2000000); // 2M

    TPM_StartTimer(BOARD_TPM_BASEADDR, kTPM_SystemClock);

    while(1)
    {
        delay();
        PRINTF(". ");
    }

    return 0;
}

